tests/wiremock/files/domaincount-response.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><soap:Body soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><snp:GetDomainCountByShopperID xmlns:snp="urn:RegDBWebSvcService"><ResultsXML>&lt;GetDomainCountByShopperID&gt;&lt;RECORDSET&gt;&lt;RECORD&gt;&lt;domains domaincount="5"&gt;example&lt;/domains&gt;&lt;/RECORD&gt;&lt;/RECORDSET&gt;&lt;/GetDomainCountByShopperID&gt;</ResultsXML></snp:GetDomainCountByShopperID></soap:Body></soap:Envelope>